In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
sats = pd.read_csv('/Users/ljia/Downloads/sat.csv')
sats.head()

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384

In [4]:
# check number of rows in dataset
len(sats.index)

478

In [7]:
#check summary statistics
sats.describe()

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score
count,478,478,478,478,478,478
unique,478,478,175,164,173,163
top,30Q450,MANHATTAN CENTER FOR SCIENCE AND MATHEMATICS,s,s,s,s
freq,1,1,57,57,57,57

In [8]:
sats = sats.dropna()

In [9]:
sats.isnull().sum()

DBN                                0
SCHOOL NAME                        0
Num of SAT Test Takers             0
SAT Critical Reading Avg. Score    0
SAT Math Avg. Score                0
SAT Writing Avg. Score             0
dtype: int64

In [ ]:
sats.